In [41]:
import pandas as pd

In [42]:
temp = [-20, -10, 10, 20]
print(temp, type(temp))

[-20, -10, 10, 20] <class 'list'>

In [43]:
temp = pd.Series(temp, index=['1월', '2월', '3월', '4월'])
temp, type(temp)

(1월   -20
 2월   -10
 3월    10
 4월    20
 dtype: int64,
 pandas.core.series.Series)

In [44]:
temp['1월']

np.int64(-20)

In [45]:
data = {
    '이름' : ['채치수', '정대만', '송태섭', '서태웅', '강백호', '변덕규', '황태산', '윤대협'],
    '학교' : ['북산고', '북산고', '북산고', '북산고', '북산고', '능남고', '능남고', '능남고'],
    '키' : [197, 184, 168, 187, 188, 202, 188, 190],
    '국어' : [90, 40, 80, 40, 15, 80, 55, 100],
    '영어' : [85, 35, 75, 60, 20, 100, 65, 85],
    '수학' : [100, 50, 70, 70, 10, 95, 45, 90],
    '과학' : [95, 55, 80, 75, 35, 85, 40, 95],
    '사회' : [85, 25, 75, 80, 10, 80, 35, 95],
    'SW특기' : ['Python', 'Java', 'Javascript', '', '', 'C', 'PYTHON', 'C#']
}

dict

    이름   학교    키   국어   영어   수학  과학  사회        SW특기
0  채치수  북산고  197   90   85  100  95  85      Python
1  정대만  북산고  184   40   35   50  55  25        Java
2  송태섭  북산고  168   80   75   70  80  75  Javascript
3  서태웅  북산고  187   40   60   70  75  80
4  강백호  북산고  188   15   20   10  35  10
5  변덕규  능남고  202   80  100   95  85  80           C
6  황태산  능남고  188   55   65   45  40  35      PYTHON
7  윤대협  능남고  190  100   85   90  95  95          C#

pandas.core.frame.DataFrame

pandas.core.series.Series

    이름   학교    키
0  채치수  북산고  197
1  정대만  북산고  184
2  송태섭  북산고  168
3  서태웅  북산고  187
4  강백호  북산고  188
5  변덕규  능남고  202

(6, 3)

     이름    키        SW특기
1번  채치수  197      Python
2번  정대만  184        Java
3번  송태섭  168  Javascript
4번  서태웅  187
5번  강백호  188